package com.ne.srm.common.constant;

public class BizConstant {

    public static final String BIZ_CONSTANT = "BizConstant";

    public static final String DEFAULT_TERM = """
        二、产品技术要求：按照双方商定和乙方工厂生产制作的技术标准。
        三、交货时间：依据甲乙双方在阿里巴巴及微信上的沟通情况，预付款到账同供方微信确认实际时间。
        四、其它包装要求：甲方提供不干胶标签(5X5cm)和/或A4说明书给乙方，乙方按甲方要求进行贴标和/或放置说明书。贴标时、放说明书时、贴(写)外箱唛头时，乙方须拍照和甲方确认。
        五、运输方式和交货地点：乙方按甲方提供的进仓单送货至甲方指定仓库，甲方承担进仓费。宁波盛亮物流：宁波市北仑区梅山盐田大道360号A1-A3 (注：盛亮物流为梅山港区仓库)
        六、产品验收：以双方确定的产品技术要求和包装要求为产品验收的依据。
        七、付款方式：30%定金，70%款到发货。乙方等甲方通知后提供合同约定发票(依据上述“发票类型”，金额为甲方付款总额)给甲方。
        八、合同条款变更和补充：合同执行过程中，一方要求变更或补充合同条款，经双方协商，书面说明后方可作为有效合同条款。单方认定的变更和补充条款应视为无效条款。
        九、违约责任：甲乙双方承诺对以上合同条款共同遵守履行。若乙方未如期交货且超过约定交期30天须全额退款给甲方。如出现产品责任不合格等违约事项，将由乙方承担相应赔偿责任，并承担由此产生的诉讼费、保全费、律师费、差旅费、担保费等维权费用。
        十、合同争议的解决方式：本合同在履行过程中发生争议，由双方当事人协商解决，协商不成，依法向合同签订地所在地人民法院提起诉讼。
        十一、合同的成立：合同须经甲乙双方签字盖章确认，传真复印件及邮件确认的扫描件等同于合同原件，具同等的法律效力。
        十二、发票类型解释：“专”指的是增值税专票，例如：“专13%”指的是含税13%的增值税专票。“普”指的是普通发票，例如：“普1%”指的是含税1%的普通发票。
        """;

    public static final String DEFAULT_TERM_2 = "二、产品技术要求：按照双方商定和乙方工厂生产制作的技术标准。";
    public static final String DEFAULT_TERM_3 = "三、交货时间：依据甲乙双方在阿里巴巴及微信上的沟通情况，预付款到账同供方微信确认实际时间。";
    public static final String DEFAULT_TERM_4 = "四、其它包装要求：甲方提供不干胶标签(5X5cm)和/或A4说明书给乙方，乙方按甲方要求进行贴标和/或放置说明书。贴标时、放说明书时、贴(写)外箱唛头时，乙方须拍照和甲方确认。";
    public static final String DEFAULT_TERM_5 = "五、运输方式和交货地点：乙方按甲方提供的进仓单送货至甲方指定仓库，甲方承担进仓费。宁波盛亮物流：宁波市北仑区梅山盐田大道360号A1-A3 (注：盛亮物流为梅山港区仓库)";
    public static final String DEFAULT_TERM_6 = "六、产品验收：以双方确定的产品技术要求和包装要求为产品验收的依据。";
    public static final String DEFAULT_TERM_7 = "七、付款方式：30%定金，70%款到发货。乙方等甲方通知后提供合同约定发票(依据上述“发票类型”，金额为甲方付款总额)给甲方。";
    public static final String DEFAULT_TERM_8 = "八、合同条款变更和补充：合同执行过程中，一方要求变更或补充合同条款，经双方协商，书面说明后方可作为有效合同条款。单方认定的变更和补充条款应视为无效条款。";
    public static final String DEFAULT_TERM_9 = "九、违约责任：甲乙双方承诺对以上合同条款共同遵守履行。若乙方未如期交货且超过约定交期30天须全额退款给甲方。如出现产品责任不合格等违约事项，将由乙方承担相应赔偿责任，并承担由此产生的诉讼费、保全费、律师费、差旅费、担保费等维权费用。";
    public static final String DEFAULT_TERM_10 = "十、合同争议的解决方式：本合同在履行过程中发生争议，由双方当事人协商解决，协商不成，依法向合同签订地所在地人民法院提起诉讼。";
    public static final String DEFAULT_TERM_11 = "十一、合同的成立：合同须经甲乙双方签字盖章确认，传真复印件及邮件确认的扫描件等同于合同原件，具同等的法律效力。";
    public static final String DEFAULT_TERM_12 = "十二、发票类型解释：“专”指的是增值税专票，例如：“专13%”指的是含税13%的增值税专票。“普”指的是普通发票，例如：“普1%”指的是含税1%的普通发票。";
}
